CSI API ETABS v1
cHelper.CreateObjectProgIDHost Method
 Starts the program and returns the API object for the given program ID on a given computer using the default TCP port.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI CreateObjectProgIDHost(
	string hostName,
	string progID
)
Function CreateObjectProgIDHost (
	hostName As String,
	progID As String
) As cOAPI
Dim instance As cHelper
Dim hostName As String
Dim progID As String
Dim returnValue As cOAPI
returnValue = instance.CreateObjectProgIDHost(hostName,
	progID)
cOAPI^ CreateObjectProgIDHost(
	String^ hostName,
	String^ progID
)
abstract CreateObjectProgIDHost :
        hostName : string *
        progID : string -> cOAPI
Parameters
hostName
Type: System.String
The host computer name.
progID
Type: System.String
The program ID of the API object.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
CSiAPIService.exe for must be running on the host computer and listening to the default TCP port for the call to succeed.
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgIDHost("RemoteServer", "CSI.ETABS.API.ETABSObject")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace